---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.StairsPathOffset
source: html/aaf13e3d-1007-e6a4-ec1a-5b00d9ccbac2.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.StairsPathOffset Property

The offset of stairs path to center line of stairs.

## Syntax (C#)
```csharp
public double StairsPathOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for stairsPathOffset is not finite
 -or-
 When setting this property: The stairsPathOffset is larger than half the width of the stairs.